Repository: DotNetAnalyzers/StyleCopAnalyzers
Catalog: StyleCop.Analyzers/StyleCop.Analyzers/SpacingRules/SpacingResources.*.resx
Languages: ru_ru

# SA1000Description
source: The spacing around a C# keyword is incorrect.
ru_ru: Неправильно выбран интервал вокруг ключевого слова C#.

# SA1000MessageFormat
source: The keyword '{0}' should{1} be followed by a space
ru_ru: За ключевым словом '{0}' должен{1} следовать пробел

# SA1000Title
source: Keywords should be spaced correctly
ru_ru: Ключевые слова должны быть расставлены правильно

# SA1001Description
source: The spacing around a comma is incorrect, within a C# code file.
ru_ru: В файле кода на языке C# неверно задан пробел вокруг запятой.

# SA1001MessageFormat
source: Commas should{0} be {1} by whitespace
ru_ru: Запятые должны{0} {1} пробелами

# SA1001Title
source: Commas should be spaced correctly
ru_ru: Запятые должны быть расставлены правильно

# SA1002Description
source: The spacing around a semicolon is incorrect, within a C# code file.
ru_ru: В файле кода на языке C# неправильно задан пробел вокруг точки с запятой.

# SA1002MessageFormat
source: Semicolons should{0} be {1} by a space
ru_ru: Точки с запятой должны {0} быть {1} пробелом

# SA1002Title
source: Semicolons should be spaced correctly
ru_ru: Точки с запятой должны быть расставлены правильно

# SA1003CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1003Description
source: The spacing around an operator symbol is incorrect, within a C# code file.
ru_ru: В файле кода на языке C# неверно задан пробелы вокруг символа оператора.

# SA1003MessageFormatFollowedByWhitespace
source: Operator '{0}' should be followed by whitespace.
ru_ru: За оператором '{0}' должен следовать пробел.

# SA1003MessageFormatNotAtEndOfLine
source: Operator '{0}' should not appear at the end of a line.
ru_ru: Оператор '{0}' не должен появляться в конце строки.

# SA1003MessageFormatNotFollowedByComment
source: Operator '{0}' should not be followed by a comment.
ru_ru: За оператором '{0}' не должен следовать комментарий.

# SA1003MessageFormatNotFollowedByWhitespace
source: Operator '{0}' should not be followed by whitespace.
ru_ru: После оператора '{0}' не должно быть пробельных символов.

# SA1003MessageFormatNotPrecededByWhitespace
source: Operator '{0}' should not be preceded by whitespace.
ru_ru: Оператору '{0}' не должны предшествовать пробельные символы.

# SA1003MessageFormatPrecededByWhitespace
source: Operator '{0}' should be preceded by whitespace.
ru_ru: Оператору '{0}' должен предшествовать пробел.

# SA1003Title
source: Symbols should be spaced correctly
ru_ru: Символы должны быть расположены правильно

# SA1004CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1004Description
source: A line within a documentation header above a C# element does not begin with a single space.
ru_ru: Строка в заголовке документации над элементом C# не начинается с одинарного пробела.

# SA1004MessageFormat
source: Documentation line should begin with a space
ru_ru: Строка документации должна начинаться с пробела

# SA1004Title
source: Documentation lines should begin with single space
ru_ru: Строки документации должны начинаться с одинарного пробела

# SA1005CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1005Description
source: A single-line comment within a C# code file does not begin with a single space.
ru_ru: Однострочный комментарий в файле кода C# не начинается с пробела.

# SA1005MessageFormat
source: Single line comment should begin with a space
ru_ru: Однострочный комментарий должен начинаться с пробела

# SA1005Title
source: Single line comments should begin with single space
ru_ru: Однострочные комментарии должны начинаться с одинарного пробела

# SA1006Description
source: A C# preprocessor-type keyword is preceded by space.
ru_ru: Ключевому слову препроцессора C# предшествует пробел.

# SA1006MessageFormat
source: Preprocessor keyword '{0}' should not be preceded by a space
ru_ru: Ключевому слову препроцессора '{0}' не должен предшествовать пробел

# SA1006Title
source: Preprocessor keywords should not be preceded by space
ru_ru: Ключевым словам препроцессора не должен предшествовать пробел

# SA1007Description
source: The operator keyword within a C# operator overload method is not followed by any whitespace.
ru_ru: За ключевым словом operator в методе перегрузки оператора C# не следует пробел.

# SA1007MessageFormat
source: Operator keyword should be followed by a space
ru_ru: За ключевым словом оператора должен следовать пробел

# SA1007Title
source: Operator keyword should be followed by space
ru_ru: За ключевым словом оператора должен следовать пробел

# SA1008CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1008Description
source: An opening parenthesis within a C# statement is not spaced correctly.
ru_ru: Открывающая скобка в операторе C# расставлены с неправильно.

# SA1008MessageNotFollowed
source: Opening parenthesis should not be followed by a space.
ru_ru: За открывающей скобкой не должен следовать пробел.

# SA1008MessageNotPreceded
source: Opening parenthesis should not be preceded by a space.
ru_ru: Открывающей скобке не должен предшествовать пробел.

# SA1008MessagePreceded
source: Opening parenthesis should be preceded by a space.
ru_ru: Открывающей скобке должен предшествовать пробел.

# SA1008Title
source: Opening parenthesis should be spaced correctly
ru_ru: Открывающая скобка должна быть расположена правильно

# SA1009Description
source: A closing parenthesis within a C# statement is not spaced correctly.
ru_ru: Закрывающая скобка в операторе C# расположена с неправильно.

# SA1009MessageFollowed
source: Closing parenthesis should be followed by a space
ru_ru: За закрывающей скобкой должен следовать пробел

# SA1009MessageNotFollowed
source: Closing parenthesis should not be followed by a space
ru_ru: За закрывающей скобкой не должен следовать пробел

# SA1009MessageNotPreceded
source: Closing parenthesis should not be preceded by a space
ru_ru: Закрывающей скобке не должен предшествовать пробел

# SA1009Title
source: Closing parenthesis should be spaced correctly
ru_ru: Закрывающая скобка должна быть расположена правильно

# SA1010Description
source: An opening square bracket within a C# statement is not spaced correctly.
ru_ru: Открывающая квадратная скобка в операторе C# расположена не правильно.

# SA1010MessageNotFollowed
source: Opening square brackets should not be followed by a space
ru_ru: За открывающими квадратными скобками не должен следовать пробел

# SA1010MessageNotPreceded
source: Opening square brackets should not be preceded by a space
ru_ru: Открывающим квадратным скобкам не должен предшествовать пробел

# SA1010Title
source: Opening square brackets should be spaced correctly
ru_ru: Открывающие квадратные скобки должны быть расставлены правильно

# SA1011Description
source: A closing square bracket within a C# statement is not spaced correctly.
ru_ru: Закрывающая квадратная скобка в операторе C# расположена неправильно.

# SA1011MessageFormat
source: Closing square bracket should{0} be {1} by a space
ru_ru: Закрывающая квадратная скобка должна{0} быть {1} пробел

# SA1011Title
source: Closing square brackets should be spaced correctly
ru_ru: Закрывающие квадратные скобки должны быть расставлены правильно

# SA1012Description
source: An opening brace within a C# element is not spaced correctly.
ru_ru: Открывающая скобка в элементе C# расположена неправильно.

# SA1012MessageFormat
source: Opening brace should{0} be {1} by a space
ru_ru: Открывающая скобка должна {0} быть {1} пробел

# SA1012Title
source: Opening braces should be spaced correctly
ru_ru: Открывающие скобки должны быть расставлены правильно

# SA1013Description
source: A closing brace within a C# element is not spaced correctly.
ru_ru: Закрывающая скобка в элементе C# расположена неправильно.

# SA1013MessageFormat
source: Closing brace should{0} be {1} by a space
ru_ru: Закрывающая скобка должна {0} быть {1} пробел

# SA1013Title
source: Closing braces should be spaced correctly
ru_ru: Закрывающие скобки должны быть расставлены правильно

# SA1014Description
source: An opening generic bracket within a C# element is not spaced correctly.
ru_ru: Открывающая скобка обобщенного типа в элементе C# расположена неправильно.

# SA1014MessageFormat
source: Opening generic brackets should not be {0} by a space
ru_ru: Открывающие скобки обобщенного типа не должны {0} пробел

# SA1014Title
source: Opening generic brackets should be spaced correctly
ru_ru: Открывающие скобки обобщенного типа должны быть расставлены правильно

# SA1015Description
source: A closing generic bracket within a C# element is not spaced correctly.
ru_ru: Закрывающая скобка обобщенного типа в элементе C# расположена неправильно.

# SA1015MessageFollowed
source: Closing generic bracket should be followed by a space
ru_ru: За закрывающей скобкой обобщенного типа должен следовать пробел

# SA1015MessageNotFollowed
source: Closing generic bracket should not be followed by a space
ru_ru: За закрывающей скобкой обобщенного типа не должен следовать пробел

# SA1015MessageNotPreceded
source: Closing generic bracket should not be preceded by a space
ru_ru: Закрывающейся скобке обобщенного типа не должен предшествовать пробел

# SA1015Title
source: Closing generic brackets should be spaced correctly
ru_ru: Закрывающие скобки обобщенного типа должны быть расставлены правильно

# SA1016Description
source: An opening attribute bracket within a C# element is not spaced correctly.
ru_ru: Открывающая скобка атрибута в элементе C# расставлена неправильно.

# SA1016MessageFormat
source: Opening attribute brackets should not be followed by a space
ru_ru: За открывающими скобками атрибутов не должен следовать пробел

# SA1016Title
source: Opening attribute brackets should be spaced correctly
ru_ru: Открывающие скобки атрибутов должны быть расставлены правильно

# SA1017Description
source: A closing attribute bracket within a C# element is not spaced correctly.
ru_ru: Закрывающая скобка атрибута в элементе C# расположена с неправильно.

# SA1017MessageFormat
source: Closing attribute brackets should not be preceded by a space
ru_ru: Закрывающие скобки атрибута не должны предваряться пробелом

# SA1017Title
source: Closing attribute brackets should be spaced correctly
ru_ru: Закрывающие скобки атрибута должны быть расставлены правильно

# SA1018CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1018Description
source: A nullable type symbol within a C# element is not spaced correctly.
ru_ru: Символ nullable типа в элементе C# расположен неправильно.

# SA1018MessageFormat
source: Nullable type symbol should not be preceded by a space
ru_ru: Перед символом nullable типа не должен стоять пробел

# SA1018Title
source: Nullable type symbols should be spaced correctly
ru_ru: Символы nullable типа должны быть расставлены правильно

# SA1019Description
source: The spacing around a member access symbol is incorrect, within a C# code file.
ru_ru: В файле кода C# неверно задан пробел вокруг символа доступа к члену.

# SA1019MessageNotFollowed
source: Member access symbol '{0}' should not be followed by a space
ru_ru: За символом доступа к члену '{0}' не должен следовать пробел

# SA1019MessageNotPreceded
source: Member access symbol '{0}' should not be preceded by a space
ru_ru: Символ доступа к члену '{0}' не должен предваряться пробелом

# SA1019Title
source: Member access symbols should be spaced correctly
ru_ru: Символы доступа к члену должны быть правильно расставлены

# SA1020Description
source: An increment or decrement symbol within a C# element is not spaced correctly.
ru_ru: Символ инкремента или декремента в элементе C# расположен неправильно.

# SA1020MessageFormat
source: {0} symbol '{1}' should not be {2} by a space
ru_ru: {0} '{1}' не должен {2} пробел

# SA1020Title
source: Increment decrement symbols should be spaced correctly
ru_ru: Символы инкремента и декремента должны быть расставлены правильно

# SA1021Description
source: A negative sign within a C# element is not spaced correctly.
ru_ru: Отрицательный знак в элементе C# расположен неправильно.

# SA1021MessageFormat
source: Negative sign should{0} be {1} by a space
ru_ru: Отрицательный знак должен {0} быть {1} пробел

# SA1021Title
source: Negative signs should be spaced correctly
ru_ru: Отрицательные знаки должны быть правильно расставлены

# SA1022Description
source: A positive sign within a C# element is not spaced correctly.
ru_ru: Положительный знак в элементе C# расположен неправильно.

# SA1022MessageFormat
source: Positive sign should{0} be {1} by a space
ru_ru: Положительный знак должен {0} быть {1} пробел

# SA1022Title
source: Positive signs should be spaced correctly
ru_ru: Положительные знаки должны быть правильно расставлены

# SA1023Description
source: A dereference symbol or an access-of symbol within a C# element is not spaced correctly.
ru_ru: Символ разыменования или символ доступа к элементу C# расположен неправильно.

# SA1023MessageFollowed
source: Dereference symbol '*' should be followed by a space
ru_ru: За символом ссылки '*' должен следовать пробел

# SA1023MessageNotAtBeginningOfLine
source: Dereference symbol '*' should not appear at the beginning of a line
ru_ru: Символ ссылки '*' не должен появляться в начале строки

# SA1023MessageNotAtEndOfLine
source: Dereference symbol '*' should not appear at the end of a line
ru_ru: Символ ссылки '*' не должен появляться в конце строки

# SA1023MessageNotFollowed
source: Dereference symbol '*' should not be followed by a space
ru_ru: За символом ссылки '*' не должен следовать пробел

# SA1023MessageNotPreceded
source: Dereference symbol '*' should not be preceded by a space
ru_ru: Символ ссылки '*' не должен предваряться пробелом

# SA1023Title
source: Dereference and access of symbols should be spaced correctly
ru_ru: Между символами ссылок и доступа должны быть правильно расставлены пробелы

# SA1024Description
source: A colon within a C# element is not spaced correctly.
ru_ru: Двоеточие в элементе C# расставлено неправильно.

# SA1024MessageFollowed
source: Colon should be followed by a space
ru_ru: После двоеточия должен стоять пробел

# SA1024MessageNotPreceded
source: Colon should not be preceded by a space
ru_ru: Двоеточию не должен предшествовать пробел

# SA1024MessagePreceded
source: Colon should be preceded by a space
ru_ru: Двоеточию должен предшествовать пробел

# SA1024Title
source: Colons Should Be Spaced Correctly
ru_ru: Двоеточия должны быть расставлены правильно

# SA1025CodeFix
source: Fix spacing
ru_ru: Исправить пробелы

# SA1025Description
source: The code contains multiple whitespace characters in a row.
ru_ru: Код содержит несколько пробельных символов подряд.

# SA1025MessageFormat
source: Code should not contain multiple whitespace characters in a row
ru_ru: Код не должен содержать несколько пробельных символов подряд

# SA1025Title
source: Code should not contain multiple whitespace in a row
ru_ru: Код не должен содержать несколько пробельных символов в строке

# SA1026Description
source: An implicitly typed array allocation within a C# code file is not spaced correctly.
ru_ru: Неявно типизированное выделение массива в файле кода C# располагается неправильно.

# SA1026MessageFormat
source: The keyword '{0}' should not be followed by a space or a blank line
ru_ru: За ключевым словом '{0}' не должен следовать пробел или пустая строка

# SA1026Title
source: Code should not contain space after new or stackalloc keyword in implicitly typed array allocation
ru_ru: Код не должен содержать пробел после ключевого слова new или stackalloc при неявно типизированном выделении массива

# SA1027CodeFix
source: Replace tabs with spaces
ru_ru: Исправить символы табуляции

# SA1027Description
source: The code contains a tab or space character which is not consistent with the current project settings.
ru_ru: Код содержит символы табуляции или пробела, которые не соответствуют текущим настройкам проекта.

# SA1027MessageFormat
source: Tabs and spaces should be used correctly
ru_ru: Табуляция и пробелы должны использоваться правильно

# SA1027Title
source: Use tabs correctly
ru_ru: Используйте табуляцию правильно

# SA1028CodeFix
source: Remove trailing whitespace
ru_ru: Удалить пробельные символы в конце строки

# SA1028Description
source: There should not be any whitespace at the end of a line of code.
ru_ru: В конце строки кода не должно быть пробелов.

# SA1028MessageFormat
source: Code should not contain trailing whitespace
ru_ru: Код не должен содержать пробельные символы в конце строки

# SA1028Title
source: Code should not contain trailing whitespace
ru_ru: Код не должен содержать пробельные символы в конце строки

# TokenSpacingCodeFix
source: Fix spacing
ru_ru: Исправить пробелы
