Repository: DotNetAnalyzers/StyleCopAnalyzers
Catalog: StyleCop.Analyzers/StyleCop.Analyzers/DocumentationRules/DocumentationResources.*.resx
Languages: fr_fr

# DestructorStandardTextFirstPart
source: Finalizes an instance of the
fr_fr: Finalise une instance de la classe

# NonPrivateConstructorStandardTextFirstPart
source: Initializes a new instance of the
fr_fr: Initialise une nouvelle instance de la {0}

# ParameterNotUsed
source: The parameter is not used.
fr_fr: Le paramètre n'est pas utilisé.

# PrivateConstructorStandardTextFirstPart
source: Prevents a default instance of the
fr_fr: Empêche la création d'une instance par défaut de la {0}

# StartingTextGets
source: Gets
fr_fr: Obtient

# StartingTextGetsOrSets
source: Gets or sets
fr_fr: Obtient ou définit

# StartingTextGetsOrSetsWhether
source: Gets or sets a value indicating whether
fr_fr: Obtient ou définit une valeur indiquant si

# StartingTextGetsWhether
source: Gets a value indicating whether
fr_fr: Obtient une valeur indiquant si

# StartingTextSets
source: Sets
fr_fr: Définit

# StartingTextSetsWhether
source: Sets a value indicating whether
fr_fr: Définit une valeur indiquant si

# StaticConstructorStandardTextFirstPart
source: Initializes static members of the
fr_fr: Initialise les membres statiques de la {0}

# TypeTextClass
source: class
fr_fr: classe

# TypeTextStruct
source: struct
fr_fr: structure
