Repository: DotNetAnalyzers/StyleCopAnalyzers
Catalog: StyleCop.Analyzers/StyleCop.Analyzers/ReadabilityRules/ReadabilityResources.*.resx
Languages: ru_ru

# IndentationCodeFix
source: Fix indentation
ru_ru: Исправить отступы

# RemoveRegionCodeFix
source: Remove region
ru_ru: Удалить регион

# SA1100CodeFix
source: Replace 'base.' with 'this.'
ru_ru: Заменить 'base.' на 'this.'

# SA1100Description
source: A call to a member from an inherited class begins with 'base.', and the local class does not contain an override or implementation of the member.
ru_ru: Вызов члена из наследуемого класса начинается с `base.`, а локальный класс не содержит переопределения или реализации этого члена.

# SA1100MessageFormat
source: Do not prefix calls with base unless local implementation exists
ru_ru: Не добавляйте к вызовам префикс base, если не существует локальной реализации

# SA1100Title
source: Do not prefix calls with base unless local implementation exists
ru_ru: Не добавляйте к вызовам префикс base, если не существует локальной реализации

# SA1101CodeFix
source: Prefix reference with 'this.'
ru_ru: Добавить к ссылке префикс 'this.'

# SA1101Description
source: A call to an instance member of the local class or a base class is not prefixed with 'this.', within a C# code file.
ru_ru: Вызов экземпляра-члена локального класса или базового класса не имеет префикса 'this.' в файле кода C#.

# SA1101MessageFormat
source: Prefix local calls with this
ru_ru: Префикс локального вызова с this

# SA1101Title
source: Prefix local calls with this
ru_ru: Префикс локального вызова с this

# SA1102CodeFix
source: Remove separating lines
ru_ru: Удаление разделяющих строк

# SA1102Description
source: A C# query clause does not begin on the same line as the previous clause, or on the next line.
ru_ru: Конструкция запроса C# не начинается с той же строки, что и предыдущая, или со следующей строки.

# SA1102MessageFormat
source: Query clause must follow previous clause.
ru_ru: Конструкция запроса должна следовать за предыдущей конструкцией.

# SA1102Title
source: Query clause must follow previous clause
ru_ru: Конструкция запроса должна следовать за предыдущей конструкцией

# SA1103CodeFixMultipleLines
source: Place on multiple lines
ru_ru: Разместить на нескольких строках

# SA1103CodeFixSingleLine
source: Place on single line
ru_ru: Разместить в одной строке

# SA1103Description
source: The clauses within a C# query expression are not all placed on the same line, and each clause is not placed on its own line.
ru_ru: Конструкции в выражении запроса C# не размещаются на одной строке, и каждая конструкция не размещается на своей строке.

# SA1103MessageFormat
source: Query clauses must be on separate lines or all on one line
ru_ru: Конструкции запроса должны быть в отдельных строках или все в одной строке

# SA1103Title
source: Query clauses must be on separate lines or all on one line
ru_ru: Конструкции запроса должны быть в отдельных строках или все в одной строке

# SA1104Description
source: A clause within a C# query expression begins on the same line as the previous clause, when the previous clause spans across multiple lines.
ru_ru: Конструкция в выражении запроса C# начинается с той же строки, что и предыдущая конструкция, если предыдущая конструкция занимает несколько строк.

# SA1104MessageFormat
source: Query clause must begin on new line when previous clause spans multiple lines
ru_ru: Конструкция запроса должна начинаться с новой строки, если предыдущая конструкция охватывает несколько строк

# SA1104SA1105CodeFix
source: Insert new line
ru_ru: Вставить новую строку

# SA1104Title
source: Query clause must begin on new line when previous clause spans multiple lines
ru_ru: Конструкция запроса должна начинаться с новой строки, если предыдущая конструкция охватывает несколько строк

# SA1105Description
source: A clause within a C# query expression spans across multiple lines, and does not begin on its own line.
ru_ru: Конструкция в выражении запроса C# охватывает несколько строк и начинается не со своей строки.

# SA1105MessageFormat
source: Query clauses spanning multiple lines must begin on own line
ru_ru: Конструкции запроса, охватывающие несколько строк, должны начинаться в собственной строке

# SA1105Title
source: Query clauses spanning multiple lines must begin on own line
ru_ru: Конструкции запроса, охватывающие несколько строк, должны начинаться в собственной строке

# SA1106CodeFix
source: Remove empty statement
ru_ru: Удаление пустого оператора

# SA1106Description
source: The C# code contains an extra semicolon.
ru_ru: Код на C# содержит лишнюю точку с запятой.

# SA1106MessageFormat
source: Code must not contain empty statements
ru_ru: Код не должен содержать пустых операторов

# SA1106Title
source: Code must not contain empty statements
ru_ru: Код не должен содержать пустых операторов

# SA1107CodeFix
source: Enter new line
ru_ru: Вставить новую строку

# SA1107Description
source: The C# code contains more than one statement on a single line.
ru_ru: Код C# содержит более одного оператора в одной строке.

# SA1107MessageFormat
source: Code must not contain multiple statements on one line
ru_ru: Код не должен содержать несколько операторов в одной строке

# SA1107Title
source: Code must not contain multiple statements on one line
ru_ru: Код не должен содержать несколько операторов в одной строке

# SA1108Description
source: A C# statement contains a comment between the declaration of the statement and the opening brace of the statement.
ru_ru: Оператор C# содержит комментарий между объявлением оператора и открывающей скобкой оператора.

# SA1108MessageFormat
source: Block statements must not contain embedded comments
ru_ru: Блоковые операторы не должны содержать встроенных комментариев

# SA1108Title
source: Block statements must not contain embedded comments
ru_ru: Блоковые операторы не должны содержать встроенных комментариев

# SA1109Description
source: A C# statement contains a region tag between the declaration of the statement and the opening brace of the statement.
ru_ru: Оператор C# содержит тег #region между объявлением оператора и открывающей скобкой оператора.

# SA1109Title
source: Block statements must not contain embedded regions
ru_ru: Блочные операторы не должны содержать встроенных областей #region

# SA1110Description
source: The opening parenthesis or bracket is not placed on the same line as the method/indexer/attribute/array name.
ru_ru: Открывающая круглая скобка или квадратная скобка не размещена в той же строке, что и имя метода/индексатора/атрибута/массива.

# SA1110MessageFormat
source: Opening parenthesis or bracket must be on declaration line.
ru_ru: Открывающая круглая скобка или квадратная скобка должна находиться в строке объявления

# SA1110Title
source: Opening parenthesis or bracket must be on declaration line
ru_ru: Открывающая круглая скобка или квадратная скобка должна находиться в строке объявления

# SA1111Description
source: The closing parenthesis or bracket in a call to or declaration of a C# method/indexer/attribute/array/constructor/delegate is not placed on the same line as the last parameter.
ru_ru: Закрывающая круглая скобка или квадратная скобка в вызове или объявлении метода/индексатора/атрибута/массива/конструктора/делегата в C# расположена не на той же строке, что и последний параметр.

# SA1111MessageFormat
source: Closing parenthesis must be on line of last parameter
ru_ru: Закрывающая скобка должна находиться на строке последнего параметра

# SA1111Title
source: Closing parenthesis must be on line of last parameter
ru_ru: Закрывающая скобка должна находиться на строке последнего параметра

# SA1112Description
source: The closing parenthesis or bracket in a call to a C# method or indexer, or the declaration of a method or indexer, is not placed on the same line as the opening bracket when the element does not take any parameters.
ru_ru: Закрывающая круглая скобка или квадратная скобка в вызове метода или индексатора C#, или в объявлении метода или индексатора не размещается на той же строке, что и открывающая скобка, если элемент не принимает никаких параметров.

# SA1112MessageFormat
source: Closing parenthesis must be on line of opening parenthesis
ru_ru: Закрывающая скобка должна находиться на одной строке с открывающей скобкой

# SA1112Title
source: Closing parenthesis must be on line of opening parenthesis
ru_ru: Закрывающая скобка должна находиться на одной строке с открывающей скобкой

# SA1113Description
source: A comma between two parameters in a call to a C# method or indexer, or in the declaration of a method or indexer, is not placed on the same line as the previous parameter.
ru_ru: Запятая между двумя параметрами в вызове метода или индексатора C#, или в объявлении метода или индексатора не размещается на той же строке, что и предыдущий параметр.

# SA1113MessageFormat
source: Comma must be on the same line as previous parameter.
ru_ru: Запятая должна стоять в той же строке, что и предыдущий параметр

# SA1113Title
source: Comma must be on the same line as previous parameter
ru_ru: Запятая должна стоять в той же строке, что и предыдущий параметр

# SA1114Description
source: The start of the parameter list for a method/constructor/indexer/array/operator call or declaration does not begin on the same line as the opening bracket, or on the line after the opening bracket.
ru_ru: Начало списка параметров для вызова метода/конструктора/индексатора/массива/оператора или объявления не начинается в той же строке, что и открывающая скобка, или в строке после открывающей скобки.

# SA1114MessageFormat
source: Parameter list must follow declaration
ru_ru: Список параметров должен следовать за объявлением

# SA1114Title
source: Parameter list must follow declaration
ru_ru: Список параметров должен следовать за объявлением

# SA1115Description
source: A parameter within a C# method or indexer call or declaration does not begin on the same line as the previous parameter, or on the next line.
ru_ru: Параметр в вызове или объявлении метода или индексатора C# не начинается в той же строке, что и предыдущий параметр, или в следующей строке.

# SA1115MessageFormat
source: The parameter must begin on the line after the previous parameter.
ru_ru: Параметр должен начинаться в строке, следующей за предыдущим параметром

# SA1115Title
source: Parameter must follow comma
ru_ru: Параметр должен следовать за запятой

# SA1116CodeFix
source: Move first argument to next line
ru_ru: Перенести первый аргумент на следующую строку

# SA1116Description
source: The parameters to a C# method or indexer call or declaration span across multiple lines, but the first parameter does not start on the line after the opening bracket.
ru_ru: Параметры вызова или объявления метода или индексатора C# занимают несколько строк, но первый параметр не начинается на строке после открывающей скобки.

# SA1116MessageFormat
source: The parameters must begin on the line after the declaration, whenever the parameter span across multiple lines
ru_ru: Параметры должны начинаться в строке следующей сразу после объявления, если параметр занимает несколько строк

# SA1116Title
source: Split parameters must start on line after declaration
ru_ru: Разделённые параметры должны начинаться в строке следующей сразу после объявления

# SA1117Description
source: The parameters to a C# method or indexer call or declaration are not all on the same line or each on a separate line.
ru_ru: Параметры вызова или объявления метода или индексатора C# не находятся в одной строке или каждый в отдельной строке.

# SA1117MessageFormat
source: The parameters must all be placed on the same line or each parameter must be placed on its own line.
ru_ru: Все параметры должны быть расположены в одной строке или каждый параметр должен быть расположен в отдельной строке

# SA1117Title
source: Parameters must be on same line or separate lines
ru_ru: Параметры должны находиться в одной строке или в отдельных строках

# SA1118Description
source: A parameter to a C# method/indexer/attribute/array, other than the first parameter, spans across multiple lines. If the parameter is short, place the entire parameter on a single line. Otherwise, save the contents of the parameter in a temporary variable and pass the temporary variable as a parameter.
ru_ru: Параметр метода/индексатора/атрибута/массива C#, кроме первого параметра, занимает несколько строк. Если параметр короткий, поместите весь параметр в одну строку. В противном случае сохраните содержимое параметра во временной переменной и передайте временную переменную в качестве параметра.

# SA1118MessageFormat
source: The parameter spans multiple lines
ru_ru: Параметр занимает несколько строк

# SA1118Title
source: Parameter must not span multiple lines
ru_ru: Параметр не должен занимать несколько строк

# SA1120CodeFix
source: Remove empty comment
ru_ru: Удалить пустой комментарий

# SA1120Description
source: The C# comment does not contain any comment text.
ru_ru: Комментарий C# не содержит никакого текста комментария.

# SA1120MessageFormat
source: Comments must contain text
ru_ru: Комментарии должны содержать текст

# SA1120Title
source: Comments must contain text
ru_ru: Комментарии должны содержать текст

# SA1121CodeFix
source: Replace with built-in type
ru_ru: Заменить на встроенный тип

# SA1121Description
source: The code uses one of the basic C# types, but does not use the built-in alias for the type.
ru_ru: В коде используется один из основных типов C#, но не используется встроенный псевдоним для этого типа.

# SA1121MessageFormat
source: Use built-in type alias
ru_ru: Использовать встроенный псевдоним типа

# SA1121Title
source: Use built-in type alias
ru_ru: Использовать встроенный псевдоним типа

# SA1122CodeFix
source: Replace with string.Empty
ru_ru: Заменить на string.Empty

# SA1122Description
source: The C# code includes an empty string, written as "".
ru_ru: В коде C# присутствует пустая строка, записанная как "".

# SA1122MessageFormat
source: Use string.Empty for empty strings
ru_ru: Используйте string.Empty для пустых строк

# SA1122Title
source: Use string.Empty for empty strings
ru_ru: Используйте string.Empty для пустых строк

# SA1123Description
source: The C# code contains a region within the body of a code element.
ru_ru: Код на языке C# содержит область #region в теле элемента кода.

# SA1123MessageFormat
source: Region must not be located within a code element.
ru_ru: Область #region не должна находиться внутри элемента кода

# SA1123Title
source: Do not place regions within elements
ru_ru: Не размещайте области #region внутри элементов

# SA1124Description
source: The C# code contains a region.
ru_ru: Код на языке C# содержит область #region.

# SA1124MessageFormat
source: Do not use regions
ru_ru: Не используйте области #region

# SA1124Title
source: Do not use regions
ru_ru: Не используйте области #region

# SA1125Description
source: The Nullable<T> type has been defined not using the C# shorthand. For example, Nullable<DateTime> has been used instead of the preferred DateTime?
ru_ru: Тип Nullable<T> был определен без использования сокращения C#. Например, Nullable<DateTime> был использован вместо предпочтительного DateTime?

# SA1125MessageFormat
source: Use shorthand for nullable types
ru_ru: Использовать сокращение для типов nullable

# SA1125Title
source: Use shorthand for nullable types
ru_ru: Использовать сокращение для типов nullable

# SA1126Description
source: A call to a member is not prefixed with the 'this.', 'base.', 'object.' or 'typename.' prefix to indicate the intended method call, within a C# code file.
ru_ru: Вызов члена не имеет префикса 'this.', 'base.', 'object.' или 'typename.' для указания предполагаемого вызова метода в файле кода C#.

# SA1126Title
source: Prefix calls correctly
ru_ru: Правильно указывайте префиксы вызовов

# SA1127CodeFix
source: Place each type constraint on a new line
ru_ru: Поместить каждое ограничение типа в новую строку

# SA1127Description
source: Each type constraint clause for a generic type parameter should be listed on a line of code by itself.
ru_ru: Каждая конструкция ограничения типа для параметра универсального типа должна быть указана в отдельной строке кода.

# SA1127MessageFormat
source: Generic type constraints must be on their own line
ru_ru: Ограничения обобщенных типов должны располагаться на своей собственной строке

# SA1127Title
source: Generic type constraints must be on their own line
ru_ru: Ограничения обобщенных типов должны располагаться на своей собственной строке

# SA1128CodeFix
source: Place constructor initializer on own line
ru_ru: Разместить инициализатор конструктора в своей собственной строке

# SA1128Description
source: A constructor initializer, including the colon character, should be on its own line.
ru_ru: Инициализатор конструктора, включая символ двоеточия, должен располагаться в отдельной строке.

# SA1128MessageFormat
source: Put constructor initializers on their own line
ru_ru: Помещать инициализаторы конструкторов в своей собственной строке

# SA1128Title
source: Put constructor initializers on their own line
ru_ru: Помещать инициализаторы конструкторов в своей собственной строке

# SA1129CodeFix
source: Replace with default(T)
ru_ru: Заменить на default(T)

# SA1129Description
source: When creating a new instance of a value type T, the syntax 'default(T)' is functionally equivalent to the syntax 'new T()'. To avoid confusion regarding the behavior of the resulting instance, the first form is preferred.
ru_ru: При создании нового экземпляра типа значений T синтаксис 'default(T)' функционально эквивалентен синтаксису 'new T()'. Чтобы избежать путаницы в поведении результирующего экземпляра, предпочтительнее использовать первую форму.

# SA1129MessageFormat
source: Do not use default value type constructor
ru_ru: Не использовать конструктор по умолчанию для типов значений

# SA1129Title
source: Do not use default value type constructor
ru_ru: Не использовать конструктор по умолчанию для типов значений

# SA1130CodeFix
source: Replace with lambda.
ru_ru: Заменить на лямбда.

# SA1130Description
source: Lambda expressions are more succinct and easier to read than anonymous methods, so they should are preferred whenever the two are functionally equivalent.
ru_ru: Лямбда-выражения более лаконичны и легче читаются, чем анонимные методы, поэтому им следует отдавать предпочтение во всех случаях, когда эти два выражения функционально эквивалентны.

# SA1130MessageFormat
source: Use lambda syntax
ru_ru: Использовать лямбда-синтаксис

# SA1130Title
source: Use lambda syntax
ru_ru: Использовать лямбда-синтаксис

# SA1131CodeFix
source: Swap operands
ru_ru: Поменять местами операнды

# SA1131Description
source: When a comparison is made between a variable and a literal, the variable should be placed on the left-hand-side to maximize readability.
ru_ru: При сравнении переменной и литерала, переменная должна располагаться с левой стороны чтобы обеспечить максимальную читабельность.

# SA1131MessageFormat
source: Constant values should appear on the right-hand side of comparisons
ru_ru: Значения констант должны располагаться в правой части сравнений

# SA1131Title
source: Use readable conditions
ru_ru: Используйте удобочитаемые условия

# SA1132CodeFix
source: Place each field on a new line
ru_ru: Перенесити каждое поле в новую строку

# SA1132Description
source: Each field should be declared on its own line, in order to clearly see each field of a type and allow for proper documentation of the behavior of each field.
ru_ru: Каждое поле должно быть объявлено в своей собственной строке, чтобы четко видеть каждое поле типа и позволить правильно документировать поведение каждого поля.

# SA1132MessageFormat
source: Each field should be declared on its own line
ru_ru: Каждое поле должно быть объявлено в своей собственной строке

# SA1132Title
source: Do not combine fields
ru_ru: Не объединяйте поля

# SA1133CodeFix
source: Give each attribute its own square brackets
ru_ru: Поместить каждый атрибут в свои собственные квадратные скобки

# SA1133Description
source: Each attribute usage should be placed in its own set of square brackets for maximum readability.
ru_ru: Для максимальной читабельности каждое использование атрибута должно быть заключено в собственные квадратные скобки.

# SA1133MessageFormat
source: Each attribute should be placed in its own set of square brackets.
ru_ru: Каждый атрибут должен быть заключен в свои собственные квадратные скобки

# SA1133Title
source: Do not combine attributes
ru_ru: Не объединяйте атрибуты

# SA1134CodeFix
source: Place attribute on own line.
ru_ru: Разместить атрибут в отдельной строке.

# SA1134Description
source: Each attribute should be placed on its own line of code.
ru_ru: Каждый атрибут должен располагаться в своей собственной строке кода.

# SA1134MessageFormat
source: Each attribute should be placed on its own line of code.
ru_ru: Каждый атрибут должен располагаться в своей собственной строке кода

# SA1134Title
source: Attributes must not share line
ru_ru: Атрибуты не должны совместно использовать одну строку

# SA1136CodeFix
source: Place enum values own their own lines
ru_ru: Размещайте значения перечислений в своих собственных строках

# SA1136Description
source: Enum values should be placed on their own lines for maximum readability.
ru_ru: Значения перечислений следует размещать в отдельных строках для максимальной читабельности.

# SA1136MessageFormat
source: Enum values should be on separate lines
ru_ru: Значения перечислений должны располагаться в отдельных строках

# SA1136Title
source: Enum values should be on separate lines
ru_ru: Значения перечислений должны располагаться в отдельных строках

# SA1137Description
source: Elements at the same level in the syntax tree should have the same indentation.
ru_ru: Элементы одного уровня в синтаксическом дереве должны иметь одинаковый отступ.

# SA1137MessageFormat
source: Elements should have the same indentation
ru_ru: Элементы должны иметь одинаковый отступ

# SA1137Title
source: Elements should have the same indentation
ru_ru: Элементы должны иметь одинаковый отступ

# SA1139CodeFix
source: Use literal suffix notation instead of casting
ru_ru: Использовать суффиксную нотацию для литералов вместо приведения

# SA1139Description
source: Use literal suffix notation instead of casting, in order to improve readability, avoid bugs related to illegal casts and ensure that optimal IL is produced.
ru_ru: Используйте суффиксную нотацию для литералов вместо приведения, чтобы улучшить читабельность, избежать ошибок, связанных с неверными приведениями, и гарантировать, что будет получен оптимальный IL.

# SA1139MessageFormat
source: Use literal suffix notation instead of casting
ru_ru: Используйте суффиксную нотацию для литералов вместо приведения

# SA1139Title
source: Use literal suffix notation instead of casting
ru_ru: Используйте суффиксную нотацию для литералов вместо приведения

# SX1101CodeFix
source: Remove 'this.' prefix
ru_ru: Удалить префикс 'this.'

# SX1101Description
source: A call to an instance member of the local class or a base class is prefixed with `this.`.
ru_ru: Локальный вызов члена экземпляра класса или базового класса имеет префикс `this.`.

# SX1101MessageFormat
source: Do not prefix local calls with 'this.'
ru_ru: Не добавляйте к локальным вызовам префикс 'this.'

# SX1101Title
source: Do not prefix local calls with 'this.'
ru_ru: Не добавляйте к локальным вызовам префикс 'this.'
